---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.ProjectReportType
source: html/6174fc57-d6d8-4478-ac3a-4748d3c3a12c.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.ProjectReportType Property

Report type: None, simple, standard, detailed

## Syntax (C#)
```csharp
public HVACLoadLoadsReportType ProjectReportType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The project report type does not fall within an appropriate range.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration